#### Terraform working directory 🏠: `demo/demo-account/network/vpc`
#### Terraform Format and Style 🖌: `success`
#### Terraform Initialization ⚙️: `success`
#### Terraform Plan 📖: `success`
<details><summary>Show Plan</summary>

```hcl
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-001"].aws_vpc_endpoint.this["dynamodb"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-001"].aws_vpc_endpoint.this["s3"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-002"].aws_vpc_endpoint.this["dynamodb"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.dynamodb"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.default_endpoints["VPC-SGP-TST-C-002"].aws_vpc_endpoint.this["s3"] will be created
  + resource "aws_vpc_endpoint" "this" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = false
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.ap-southeast-1.s3"
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags_all              = (known after apply)
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + timeouts {
          + create = "10m"
          + delete = "10m"
          + update = "10m"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + tags_all               = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl.tgw[0] will be created
  + resource "aws_network_acl" "tgw" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "VPC-SGP-TST-C-001-tgw"
        }
      + tags_all   = {
          + "Name" = "VPC-SGP-TST-C-001-tgw"
        }
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl_rule.tgw_inbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_network_acl_rule.tgw_outbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-PRT-AP01-ALL"
          + "RouteTableType" = "intra"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-PRT-AP01-ALL"
          + "RouteTableType" = "intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table.tgw[0] will be created
  + resource "aws_route_table" "tgw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.tgw[0] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_route_table_association.tgw[1] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZA"
          + "kubernetes.io/role/internal-elb" = "1"
          + "test"                            = "test"
        }
      + tags_all                                       = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZA"
          + "kubernetes.io/role/internal-elb" = "1"
          + "test"                            = "test"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZB"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + tags_all                                       = {
          + "Name"                            = "SN-SGP-TST-PRT-AP01-AZB"
          + "kubernetes.io/role/internal-elb" = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.tgw[0] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.128/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZA"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_subnet.tgw[1] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.18.76.144/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZB"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-TGW-AZB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.18.76.0/25"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + tags_all                             = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name_servers  = [
          + "AmazonProvidedDNS",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = [
          + "169.254.169.123",
        ]
      + owner_id             = (known after apply)
      + tags                 = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
      + tags_all             = {
          + "Name" = "VPC-SGP-TST-C-001"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-001"].aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "172.18.76.128/26"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + tags_all               = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + vpc_id                 = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl.tgw[0] will be created
  + resource "aws_network_acl" "tgw" {
      + arn        = (known after apply)
      + egress     = (known after apply)
      + id         = (known after apply)
      + ingress    = (known after apply)
      + owner_id   = (known after apply)
      + subnet_ids = (known after apply)
      + tags       = {
          + "Name" = "VPC-SGP-TST-C-002-tgw"
        }
      + tags_all   = {
          + "Name" = "VPC-SGP-TST-C-002-tgw"
        }
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl_rule.tgw_inbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_inbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = false
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_network_acl_rule.tgw_outbound[0] will be created
  + resource "aws_network_acl_rule" "tgw_outbound" {
      + cidr_block     = "0.0.0.0/0"
      + egress         = true
      + from_port      = 0
      + id             = (known after apply)
      + network_acl_id = (known after apply)
      + protocol       = "-1"
      + rule_action    = "allow"
      + rule_number    = 100
      + to_port        = 0
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table.intra[0] will be created
  + resource "aws_route_table" "intra" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-PRT-AP02-ALL"
          + "RouteTableType" = "intra"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-PRT-AP02-ALL"
          + "RouteTableType" = "intra"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table.tgw[0] will be created
  + resource "aws_route_table" "tgw" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"           = "RTB-SGP-TST-02-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + tags_all         = {
          + "Name"           = "RTB-SGP-TST-02-PRT-TGW-ALL"
          + "RouteTableType" = "tgw"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.intra[0] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.intra[1] will be created
  + resource "aws_route_table_association" "intra" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.tgw[0] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_route_table_association.tgw[1] will be created
  + resource "aws_route_table_association" "tgw" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.intra[0] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.0/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZA"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.intra[1] will be created
  + resource "aws_subnet" "intra" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZB"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-PRT-AP02-AZB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.tgw[0] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.128/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZA"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZA"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_subnet.tgw[1] will be created
  + resource "aws_subnet" "tgw" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "172.19.76.144/28"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZB"
        }
      + tags_all                                       = {
          + "Name" = "SN-SGP-TST-02-PRT-TGW-AZB"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "172.19.76.0/25"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + tags_all                             = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_dhcp_options.this[0] will be created
  + resource "aws_vpc_dhcp_options" "this" {
      + arn                  = (known after apply)
      + domain_name_servers  = [
          + "AmazonProvidedDNS",
        ]
      + id                   = (known after apply)
      + netbios_name_servers = []
      + ntp_servers          = [
          + "169.254.169.123",
        ]
      + owner_id             = (known after apply)
      + tags                 = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
      + tags_all             = {
          + "Name" = "VPC-SGP-TST-C-002"
        }
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_dhcp_options_association.this[0] will be created
  + resource "aws_vpc_dhcp_options_association" "this" {
      + dhcp_options_id = (known after apply)
      + id              = (known after apply)
      + vpc_id          = (known after apply)
    }

  # module.vpc.module.vpc["VPC-SGP-TST-C-002"].aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "172.19.76.128/26"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

Plan: 40 to add, 0 to change, 0 to destroy.

```

</details>

**Pusher**: @bitzhouwen
**Action**: pull_request
